       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATMTRX01.
       DATA DIVISION.

       LINKAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY "I AM IN THE CALLED PROGRAM OF NUMBER 2".
           EXIT PROGRAM.
